Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/qspi.h
/* -------- QSPI_RCR : (QSPI Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define QSPI_RCR_RXCTR_Pos                    _UINT32_(0)                                          /* (QSPI_RCR) Receive Counter Register Position */
#define QSPI_RCR_RXCTR_Msk                    (_UINT32_(0xFFFF) << QSPI_RCR_RXCTR_Pos)             /* (QSPI_RCR) Receive Counter Register Mask */
#define QSPI_RCR_RXCTR(value)                 (QSPI_RCR_RXCTR_Msk & (_UINT32_(value) << QSPI_RCR_RXCTR_Pos)) /* Assigment of value for RXCTR in the QSPI_RCR register */
#define QSPI_RCR_Msk                          _UINT32_(0x0000FFFF)                                 /* (QSPI_RCR) Register Mask  */


/* -------- QSPI_TPR : (QSPI Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#define QSPI_TPR_TXPTR_Pos                    _UINT32_(0)                                          /* (QSPI_TPR) Transmit Counter Register Position */
#define QSPI_TPR_TXPTR_Msk                    (_UINT32_(0xFFFFFFFF) << QSPI_TPR_TXPTR_Pos)         /* (QSPI_TPR) Transmit Counter Register Mask */
#define QSPI_TPR_TXPTR(value)                 (QSPI_TPR_TXPTR_Msk & (_UINT32_(value) << QSPI_TPR_TXPTR_Pos)) /* Assigment of value for TXPTR in the QSPI_TPR register */
#define QSPI_TPR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (QSPI_TPR) Register Mask  */


/* -------- QSPI_TCR : (QSPI Offset: 0x10C) (R/W 32) Transmit Counter Register -------- */
#define QSPI_TCR_TXCTR_Pos                    _UINT32_(0)                                          /* (QSPI_TCR) Transmit Counter Register Position */
#define QSPI_TCR_TXCTR_Msk                    (_UINT32_(0xFFFF) << QSPI_TCR_TXCTR_Pos)             /* (QSPI_TCR) Transmit Counter Register Mask */
#define QSPI_TCR_TXCTR(value)                 (QSPI_TCR_TXCTR_Msk & (_UINT32_(value) << QSPI_TCR_TXCTR_Pos)) /* Assigment of value for TXCTR in the QSPI_TCR register */
#define QSPI_TCR_Msk                          _UINT32_(0x0000FFFF)                                 /* (QSPI_TCR) Register Mask  */


/* -------- QSPI_RNPR : (QSPI Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define QSPI_RNPR_RXNPTR_Pos                  _UINT32_(0)                                          /* (QSPI_RNPR) Receive Next Pointer Position */
#define QSPI_RNPR_RXNPTR_Msk                  (_UINT32_(0xFFFFFFFF) << QSPI_RNPR_RXNPTR_Pos)       /* (QSPI_RNPR) Receive Next Pointer Mask */
#define QSPI_RNPR_RXNPTR(value)               (QSPI_RNPR_RXNPTR_Msk & (_UINT32_(value) << QSPI_RNPR_RXNPTR_Pos)) /* Assigment of value for RXNPTR in the QSPI_RNPR register */
#define QSPI_RNPR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (QSPI_RNPR) Register Mask  */


/* -------- QSPI_RNCR : (QSPI Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define QSPI_RNCR_RXNCTR_Pos                  _UINT32_(0)                                          /* (QSPI_RNCR) Receive Next Counter Position */
#define QSPI_RNCR_RXNCTR_Msk                  (_UINT32_(0xFFFF) << QSPI_RNCR_RXNCTR_Pos)           /* (QSPI_RNCR) Receive Next Counter Mask */
#define QSPI_RNCR_RXNCTR(value)               (QSPI_RNCR_RXNCTR_Msk & (_UINT32_(value) << QSPI_RNCR_RXNCTR_Pos)) /* Assigment of value for RXNCTR in the QSPI_RNCR register */
#define QSPI_RNCR_Msk                         _UINT32_(0x0000FFFF)                                 /* (QSPI_RNCR) Register Mask  */


/* -------- QSPI_TNPR : (QSPI Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#define QSPI_TNPR_TXNPTR_Pos                  _UINT32_(0)                                          /* (QSPI_TNPR) Transmit Next Pointer Position */
#define QSPI_TNPR_TXNPTR_Msk                  (_UINT32_(0xFFFFFFFF) << QSPI_TNPR_TXNPTR_Pos)       /* (QSPI_TNPR) Transmit Next Pointer Mask */
#define QSPI_TNPR_TXNPTR(value)               (QSPI_TNPR_TXNPTR_Msk & (_UINT32_(value) << QSPI_TNPR_TXNPTR_Pos)) /* Assigment of value for TXNPTR in the QSPI_TNPR register */
#define QSPI_TNPR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (QSPI_TNPR) Register Mask  */


/* -------- QSPI_TNCR : (QSPI Offset: 0x11C) (R/W 32) Transmit Next Counter Register -------- */
#define QSPI_TNCR_TXNCTR_Pos                  _UINT32_(0)                                          /* (QSPI_TNCR) Transmit Counter Next Position */
#define QSPI_TNCR_TXNCTR_Msk                  (_UINT32_(0xFFFF) << QSPI_TNCR_TXNCTR_Pos)           /* (QSPI_TNCR) Transmit Counter Next Mask */
#define QSPI_TNCR_TXNCTR(value)               (QSPI_TNCR_TXNCTR_Msk & (_UINT32_(value) << QSPI_TNCR_TXNCTR_Pos)) /* Assigment of value for TXNCTR in the QSPI_TNCR register */
#define QSPI_TNCR_Msk                         _UINT32_(0x0000FFFF)                                 /* (QSPI_TNCR) Register Mask  */


/* -------- QSPI_PTCR : (QSPI Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define QSPI_PTCR_RXTEN_Pos                   _UINT32_(0)                                          /* (QSPI_PTCR) Receiver Transfer Enable Position */
#define QSPI_PTCR_RXTEN_Msk                   (_UINT32_(0x1) << QSPI_PTCR_RXTEN_Pos)               /* (QSPI_PTCR) Receiver Transfer Enable Mask */
#define QSPI_PTCR_RXTEN(value)                (QSPI_PTCR_RXTEN_Msk & (_UINT32_(value) << QSPI_PTCR_RXTEN_Pos)) /* Assigment of value for RXTEN in the QSPI_PTCR register */
#define QSPI_PTCR_RXTDIS_Pos                  _UINT32_(1)                                          /* (QSPI_PTCR) Receiver Transfer Disable Position */
#define QSPI_PTCR_RXTDIS_Msk                  (_UINT32_(0x1) << QSPI_PTCR_RXTDIS_Pos)              /* (QSPI_PTCR) Receiver Transfer Disable Mask */
#define QSPI_PTCR_RXTDIS(value)               (QSPI_PTCR_RXTDIS_Msk & (_UINT32_(value) << QSPI_PTCR_RXTDIS_Pos)) /* Assigment of value for RXTDIS in the QSPI_PTCR register */
#define QSPI_PTCR_TXTEN_Pos                   _UINT32_(8)                                          /* (QSPI_PTCR) Transmitter Transfer Enable Position */
#define QSPI_PTCR_TXTEN_Msk                   (_UINT32_(0x1) << QSPI_PTCR_TXTEN_Pos)               /* (QSPI_PTCR) Transmitter Transfer Enable Mask */
#define QSPI_PTCR_TXTEN(value)                (QSPI_PTCR_TXTEN_Msk & (_UINT32_(value) << QSPI_PTCR_TXTEN_Pos)) /* Assigment of value for TXTEN in the QSPI_PTCR register */
#define QSPI_PTCR_TXTDIS_Pos                  _UINT32_(9)                                          /* (QSPI_PTCR) Transmitter Transfer Disable Position */
#define QSPI_PTCR_TXTDIS_Msk                  (_UINT32_(0x1) << QSPI_PTCR_TXTDIS_Pos)              /* (QSPI_PTCR) Transmitter Transfer Disable Mask */
#define QSPI_PTCR_TXTDIS(value)               (QSPI_PTCR_TXTDIS_Msk & (_UINT32_(value) << QSPI_PTCR_TXTDIS_Pos)) /* Assigment of value for TXTDIS in the QSPI_PTCR register */
#define QSPI_PTCR_RXCBEN_Pos                  _UINT32_(16)                                         /* (QSPI_PTCR) Receiver Circular Buffer Enable Position */
#define QSPI_PTCR_RXCBEN_Msk                  (_UINT32_(0x1) << QSPI_PTCR_RXCBEN_Pos)              /* (QSPI_PTCR) Receiver Circular Buffer Enable Mask */
#define QSPI_PTCR_RXCBEN(value)               (QSPI_PTCR_RXCBEN_Msk & (_UINT32_(value) << QSPI_PTCR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the QSPI_PTCR register */
#define QSPI_PTCR_RXCBDIS_Pos                 _UINT32_(17)                                         /* (QSPI_PTCR) Receiver Circular Buffer Disable Position */
#define QSPI_PTCR_RXCBDIS_Msk                 (_UINT32_(0x1) << QSPI_PTCR_RXCBDIS_Pos)             /* (QSPI_PTCR) Receiver Circular Buffer Disable Mask */
#define QSPI_PTCR_RXCBDIS(value)              (QSPI_PTCR_RXCBDIS_Msk & (_UINT32_(value) << QSPI_PTCR_RXCBDIS_Pos)) /* Assigment of value for RXCBDIS in the QSPI_PTCR register */
#define QSPI_PTCR_TXCBEN_Pos                  _UINT32_(18)                                         /* (QSPI_PTCR) Transmitter Circular Buffer Enable Position */
#define QSPI_PTCR_TXCBEN_Msk                  (_UINT32_(0x1) << QSPI_PTCR_TXCBEN_Pos)              /* (QSPI_PTCR) Transmitter Circular Buffer Enable Mask */
#define QSPI_PTCR_TXCBEN(value)               (QSPI_PTCR_TXCBEN_Msk & (_UINT32_(value) << QSPI_PTCR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the QSPI_PTCR register */
#define QSPI_PTCR_TXCBDIS_Pos                 _UINT32_(19)                                         /* (QSPI_PTCR) Transmitter Circular Buffer Disable Position */
#define QSPI_PTCR_TXCBDIS_Msk                 (_UINT32_(0x1) << QSPI_PTCR_TXCBDIS_Pos)             /* (QSPI_PTCR) Transmitter Circular Buffer Disable Mask */
#define QSPI_PTCR_TXCBDIS(value)              (QSPI_PTCR_TXCBDIS_Msk & (_UINT32_(value) << QSPI_PTCR_TXCBDIS_Pos)) /* Assigment of value for TXCBDIS in the QSPI_PTCR register */
#define QSPI_PTCR_ERRCLR_Pos                  _UINT32_(24)                                         /* (QSPI_PTCR) Transfer Bus Error Clear Position */
#define QSPI_PTCR_ERRCLR_Msk                  (_UINT32_(0x1) << QSPI_PTCR_ERRCLR_Pos)              /* (QSPI_PTCR) Transfer Bus Error Clear Mask */
#define QSPI_PTCR_ERRCLR(value)               (QSPI_PTCR_ERRCLR_Msk & (_UINT32_(value) << QSPI_PTCR_ERRCLR_Pos)) /* Assigment of value for ERRCLR in the QSPI_PTCR register */
#define QSPI_PTCR_Msk                         _UINT32_(0x010F0303)                                 /* (QSPI_PTCR) Register Mask  */


